"""
Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
Результат: [12, 44, 4, 10, 78, 123].

"""


def list_processing(input_list):
    return [input_list[i] for i in range(1, len(input_list)) if input_list[i] > input_list[i-1]]


new_list = list_processing([300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55])
print(new_list)
