"""
Реализовать скрипт:
а) итератор, генерирующий целые числа, начиная с указанного,
Подсказка: использовать функцию count() и cycle() модуля itertools.
Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
"""

from sys import argv
from itertools import count


def counter(start_int):
    try:
        start_int = int(start_int)
    except ValueError:
        print("Ошибка ввода данных")
    for el in count(start_int):
        if el > 10:
            break
        else:
            print(el)


counter(argv[1])
